Repository: tunckankilic/tuncbt
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Language
tr: Dil

source: Login
tr: Giriş Yap

source: Register
tr: Kayıt Ol

source: Cancel
tr: İptal

source: OK
tr: Tamam

source: Tasks
tr: Görevler

source: Profile
tr: Profil

source: Save
tr: Kaydet

source: Delete
tr: Sil

source: Edit
tr: Düzenle

source: Create
tr: Oluştur

source: Task Title
tr: Görev Başlığı

source: Task Description
tr: Görev Açıklaması

source: Task Deadline
tr: Son Tarih

source: Task Category
tr: Görev Kategorisi

source: Upload Task
tr: Görev Yükle

source: Delete Task
tr: Görevi Sil

# deleteTaskConfirm
source: Are you sure you want to delete this task?
tr: Bu görevi silmek istediğinizden emin misiniz?

# taskDeleted
source: Task deleted successfully
tr: Görev başarıyla silindi

# taskDeleteError
source: An error occurred while deleting the task
tr: Görev silinirken bir hata oluştu

# taskUploadSuccess
source: Task uploaded successfully
tr: Görev yüklendi ve bildirim oluşturuldu

# taskUploadError
source: Error uploading task
tr: Görev yüklenirken bir hata oluştu

# noTasks
source: No Tasks Found
tr: Henüz ekip görevi yok

# addTaskHint
source: Add your first task to get started
tr: Yeni görev eklemek için + butonuna tıklayın

# allFieldsRequired
source: All fields marked with * are required
tr: Tüm alanlar zorunludur

# fieldRequired
source: This field is required
tr: Bu alan zorunludur

source: Team Tasks
tr: Ekip Görevleri

source: New Task
tr: Yeni Görev

source: Team Members
tr: Ekip Üyeleri

# noTeamMembers
source: No team members found
tr: Henüz ekip üyesi yok

# inviteMembersHint
source: Invite team members to get started
tr: Ekibinize yeni üyeler eklemek için referans kodunuzu paylaşın

source: Logout
tr: Çıkış Yap

# logoutConfirm
source: Are you sure you want to logout?
tr: Çıkış yapmak istediğinizden emin misiniz?

source: Team Name
tr: Ekip Adı

source: Referral Code
tr: Referans Kodu

# referralCodeTitle
source: What is Referral Code?
tr: Referans Kodu Nedir?

# referralCodeDescription
source: A referral code allows you to join an existing team. If you don't have a referral code, you can create a new team.
tr: Referans kodu, bir takıma katılmak için kullanılan 8 karakterlik özel bir koddur. Eğer bir takıma katılmak istiyorsanız, takım yöneticisinden alacağınız referans kodunu giriniz. Eğer kendi takımınızı oluşturmak istiyorsanız bu alanı boş bırakabilirsiniz.

# referralCodeOptional
source: Optional
tr: Referans kodu opsiyoneldir. Eğer kendi takımınızı oluşturmak istiyorsanız boş bırakabilirsiniz.

source: Invite Members
tr: Üye Davet Et

source: Share Referral Code
tr: Referans Kodunu Paylaş

source: Team Settings
tr: Ekip Ayarları

source: Leave Team
tr: Ekipten Ayrıl

# leaveTeamConfirm
source: Are you sure you want to leave this team?
tr: Ekipten ayrılmak istediğinizden emin misiniz?

source: Delete Account
tr: Hesabı Sil

# deleteAccountConfirm
source: Are you sure you want to delete your account? This action cannot be undone.
tr: Hesabınızı silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Team Information
tr: Ekip Bilgileri

source: Position
tr: Pozisyon

source: Enter name
tr: İsminizi girin

source: Quick Actions
tr: Hızlı İşlemler

source: Close
tr: Kapat

source: Leave
tr: Ayrıl

source: Login required
tr: Giriş yapmanız gerekiyor

source: User not found
tr: Kullanıcı bulunamadı

# loginEmail
source: Email
tr: E-posta

# loginPassword
source: Password
tr: Şifre

# loginNoAccount
source: Don't have an account?
tr: Hesabınız yok mu?

# loginResetPassword
source: Reset Password
tr: Şifremi Unuttum

# registerEmail
source: Email
tr: E-posta Adresi

# registerName
source: Full Name
tr: Ad Soyad

# registerPhone
source: Phone
tr: Telefon Numarası

# registerPosition
source: Position
tr: Şirketteki Pozisyon

# forgotPasswordTitle
source: Forgot Password
tr: Şifremi Unuttum

# forgotPasswordSubtitle
source: Enter your email to reset your password
tr: Şifrenizi sıfırlamak için e-posta adresinizi girin

# forgotPasswordEmail
source: Email Address
tr: E-posta Adresi

# forgotPasswordReset
source: Reset Password
tr: Şifremi Sıfırla

# forgotPasswordBackToLogin
source: Back to Login
tr: Giriş Ekranına Dön

# authErrorUserNotFound
source: No user found with this email
tr: Bu e-posta adresiyle kayıtlı kullanıcı bulunamadı

# authErrorWrongPassword
source: Wrong password
tr: Hatalı şifre. Lütfen tekrar deneyin

# authErrorInvalidEmail
source: Invalid email address
tr: Geçersiz e-posta adresi

# authErrorUserDisabled
source: This account has been disabled
tr: Bu hesap devre dışı bırakıldı

# authErrorEmailInUse
source: This email is already in use
tr: Bu e-posta adresi zaten kullanımda

# authErrorOperationNotAllowed
source: Operation not allowed
tr: Bu işleme şu anda izin verilmiyor

# authErrorWeakPassword
source: Password is too weak
tr: Şifre çok zayıf. Lütfen daha güçlü bir şifre seçin

# authErrorNetworkFailed
source: Network connection failed
tr: Ağ bağlantı hatası. Lütfen internet bağlantınızı kontrol edin

# authErrorTooManyRequests
source: Too many attempts. Please try again later
tr: Çok fazla başarısız giriş denemesi. Lütfen daha sonra tekrar deneyin

# authErrorInvalidCredential
source: Invalid credentials
tr: Geçersiz kimlik bilgileri

# authErrorAccountExists
source: Account already exists with different credentials
tr: Bu e-posta adresiyle farklı bir giriş yöntemi kullanan bir hesap zaten var

# authErrorInvalidVerificationCode
source: Invalid verification code
tr: Geçersiz doğrulama kodu

# authErrorInvalidVerificationId
source: Invalid verification ID
tr: Geçersiz doğrulama ID'si

# authErrorQuotaExceeded
source: Quota exceeded
tr: Kota aşıldı. Lütfen daha sonra tekrar deneyin

# authErrorCredentialInUse
source: Credential already in use
tr: Bu kimlik bilgileri başka bir hesapla ilişkilendirilmiş

# authErrorRequiresRecentLogin
source: Please log in again to continue
tr: Bu işlem için yakın zamanda giriş yapmanız gerekiyor. Lütfen çıkış yapıp tekrar giriş yapın

# authErrorGeneric
source: An error occurred. Please try again
tr: Bir hata oluştu. Lütfen tekrar deneyin

# noPermissionToDelete
source: You don't have permission for this action
tr: Bu işlemi yapmak için yetkiniz yok

source: Error
tr: Hata

source: Retry
tr: Tekrar Dene

source: Success
tr: Başarılı

# operationSuccess
source: Operation completed successfully
tr: İşlem başarıyla tamamlandı

source: Join Team
tr: Takıma Katıl

source: Create Team
tr: Takım Oluştur

# fieldMissing
source: This field cannot be empty
tr: Bu alan zorunludur

# invalidPassword
source: Password must be at least 7 characters
tr: Lütfen geçerli bir şifre girin

source: Passwords do not match
tr: Şifreler eşleşmiyor

# creatingTeam
source: Creating your team... Please wait.
tr: Takımınız oluşturuluyor... Lütfen bekleyin.

source: Email
tr: E-posta

source: Password
tr: Şifre

source: Phone Number
tr: Telefon Numarası

source: All Workers
tr: Tüm Çalışanlar

source: Team not found
tr: Takım bulunamadı

# permissionDenied
source: You don't have permission for this action
tr: Bu işlem için yetkiniz bulunmamaktadır

source: Privacy Policy
tr: Gizlilik Politikası

source: Terms of Service
tr: Kullanım Şartları

# acceptTerms
source: I accept the Terms of Service and Privacy Policy
tr: Kullanım Şartları ve Gizlilik Politikasını kabul ediyorum

# acceptDataProcessing
source: I accept the processing of my personal data
tr: Kişisel verilerimin işlenmesine onay veriyorum

# acceptAgeRestriction
source: I confirm that I am over 18 years old
tr: 13 yaşından büyük olduğumu onaylıyorum

# notificationPermissionText
source: I want to receive notifications
tr: Ekibinizin aktivitelerinden haberdar olmak için bildirimlere izin verin

# lastUpdated
source: Last updated: {date}
tr: Son güncelleme: {date}

source: Chats
tr: Sohbetler

source: Groups
tr: Gruplar

source: New Chat
tr: Yeni Sohbet

source: New Group
tr: Yeni Grup

source: Group Name
tr: Grup Adı

source: Group Description
tr: Açıklama (İsteğe bağlı)

source: Group Members
tr: Üyeler

# noMembers
source: No members available to add
tr: Eklenebilecek üye bulunamadı

# selectMembers
source: Please select at least one member
tr: En az bir üye seçmelisiniz

# groupCreationError
source: Error creating group
tr: Grup oluşturulurken bir hata oluştu

# noChats
source: No chats yet
tr: Henüz mesajınız yok

# noGroups
source: You are not a member of any group yet
tr: Henüz bir gruba üye değilsiniz

# memberCount
source: {count} members
tr: {count} üye

source: Delete Chat
tr: Sohbeti Sil

# deleteChatConfirm
source: Are you sure you want to delete this chat?
tr: Bu sohbeti silmek istediğinizden emin misiniz?

# micPermissionTitle
source: Microphone Permission
tr: Mikrofon İzni

# micPermissionMessage
source: We need microphone access to record voice messages
tr: Sesli mesaj göndermek için mikrofon iznine ihtiyacımız var. İzin vermek ister misiniz?

source: Not Now
tr: ŞİMDİ DEĞİL

# continueAction
source: Continue
tr: DEVAM ET

source: Permission Required
tr: İzin Gerekli

# micPermissionSettingsMessage
source: Please enable microphone access in settings
tr: Sesli mesaj göndermek için mikrofon izni gerekli. Lütfen ayarlardan izin verin.

source: Open Settings
tr: AYARLARI AÇ

source: Recording Error
tr: Hata

# recordingStartError
source: Failed to start recording
tr: Kayıt başlatılamadı

# recordingStopError
source: Failed to stop recording
tr: Kayıt durdurulamadı

# filePickingError
source: Error picking file
tr: Dosya seçilirken bir hata oluştu

source: Photo
tr: Fotoğraf

# messageDeletionError
source: Error deleting message
tr: Mesaj silinirken bir hata oluştu

source: User blocked
tr: Kullanıcı engellendi

# userBlockError
source: Error blocking user
tr: Kullanıcı engellenirken bir hata oluştu

source: User unblocked
tr: Kullanıcının engeli kaldırıldı

# userUnblockError
source: Error unblocking user
tr: Kullanıcının engeli kaldırılırken bir hata oluştu

# groupCreated
source: Group created successfully
tr: Grup başarıyla oluşturuldu

# onlyAdminsCanAdd
source: Only admins can add members
tr: Yalnızca grup yöneticileri üye ekleyebilir

# onlyAdminsCanRemove
source: Only admins can remove members
tr: Üyeleri yalnızca grup yöneticileri çıkarabilir

# onlyAdminsCanPromote
source: Only admins can promote members
tr: Yeni yönetici atamasını yalnızca grup yöneticileri yapabilir

source: Failed to send message
tr: Mesaj gönderilemedi. Lütfen tekrar deneyin

source: Failed to send file
tr: Dosya gönderilemedi

source: GIF sent successfully
tr: GIF başarıyla gönderildi

source: Failed to send GIF
tr: GIF gönderilemedi

# loginTitle
source: Login
tr: Giriş Yap

# registerPassword
source: Password
tr: Şifre

# registerConfirmPassword
source: Confirm Password
tr: Şifre Tekrar

# registerHasAccount
source: Already have an account?
tr: Zaten hesabınız var mı?

# teamMemberCount
source: {count} Members
tr: {count} üye

# teamMembersLowercase
source: members
tr: üye

source: Choose Your Job
tr: İş Pozisyonunuzu Seçin

source: No Team Yet
tr: Henüz bir takıma ait değilsiniz

# tasksRequireTeam
source: You need to be part of a team to manage tasks
tr: Görevleri görüntülemek için bir takıma katılmanız gerekiyor

source: Delete Comment
tr: Yorumu Sil

# deleteCommentConfirm
source: Are you sure you want to delete this comment?
tr: Bu yorumu silmek istediğinizden emin misiniz?

source: Just now
tr: Az önce

# minutesAgo
source: {minutes} minutes ago
tr: {minutes} dakika önce

# hoursAgo
source: {hours} hours ago
tr: {hours} saat önce

# daysAgo
source: {days} days ago
tr: {days} gün önce

source: Data Collection
tr: Veri Toplama ve Kullanım

# dataCollectionDesc
source: We collect necessary information to provide our services.
tr: Uygulamamız, size daha iyi hizmet verebilmek için bazı kişisel verilerinizi toplar ve işler. Bu veriler şunları içerir: • İsim ve e-posta adresi • Profil fotoğrafı • Telefon numarası • Takım ve görev bilgileri • Kullanım istatistikleri

source: Data Security
tr: Veri Güvenliği

# dataSecurityDesc
source: We implement security measures to protect your data.
tr: Verileriniz Firebase altyapısı kullanılarak güvenli bir şekilde saklanır ve şifrelenir. Verilerinize sadece yetkili kişiler erişebilir.

source: Data Sharing
tr: Veri Paylaşımı

# dataSharingDesc
source: We only share data with your consent or as required by law.
tr: Verileriniz üçüncü taraflarla paylaşılmaz. Sadece takım üyeleri arasında gerekli bilgiler paylaşılır.

source: Data Deletion
tr: Veri Silme

# dataDeletionDesc
source: You can request deletion of your personal data.
tr: Hesabınızı sildiğinizde, tüm kişisel verileriniz ve ilgili içerikler (mesajlar, yorumlar, görevler) kalıcı olarak silinir.

source: Cookies
tr: Çerezler

# cookiesDesc
source: We use cookies to improve your experience.
tr: Uygulamamız, daha iyi bir kullanıcı deneyimi sağlamak için çerezler kullanabilir.

# contactInfo
source: Contact Information
tr: İletişim

# contactInfoDesc
source: For privacy concerns, please contact us.
tr: Gizlilik politikamız hakkında sorularınız için support@tuncbt.com adresinden bize ulaşabilirsiniz

# termsAgeRestriction
source: Age Restriction
tr: Yaş Sınırlaması

# termsAgeRestrictionDesc
source: Users must be 18 years or older to use this service.
tr: Bu uygulamayı kullanmak için en az 13 yaşında olmanız gerekmektedir. 13 yaşından küçükseniz, ebeveyn veya yasal vasi gözetiminde kullanmanız gerekir.

source: Account Security
tr: Hesap Güvenliği

# accountSecurityDesc
source: Users are responsible for maintaining the security of their accounts.
tr: Hesap güvenliğinizden siz sorumlusunuz. Şifrenizi kimseyle paylaşmayın ve güvenli bir şekilde saklayın.

source: Unacceptable Behavior
tr: Kabul Edilemez Davranışlar

# unacceptableBehaviorDesc
source: Any form of harassment, abuse, or illegal activities is strictly prohibited.
tr: • Yasadışı içerik paylaşımı • Spam veya istenmeyen içerik • Taciz veya zorbalık • Başkalarının kişisel verilerini izinsiz paylaşma • Sistemin kötüye kullanımı

source: Content Rights
tr: İçerik Hakları

# contentRightsDesc
source: Users retain rights to their content while granting us license to use it.
tr: Paylaştığınız içeriklerin haklarının size ait olduğunu veya paylaşma hakkına sahip olduğunuzu teyit etmelisiniz.

source: Service Changes
tr: Hizmet Değişiklikleri

# serviceChangesDesc
source: We reserve the right to modify or discontinue services with notice.
tr: Hizmetlerimizi önceden haber vermeksizin değiştirme, askıya alma veya sonlandırma hakkını saklı tutarız.

source: Disclaimer
tr: Sorumluluk Reddi

# disclaimerDesc
source: Service is provided 'as is' without warranties.
tr: Uygulama 'olduğu gibi' sunulmaktadır. Kesintisiz veya hatasız çalışacağına dair garanti vermiyoruz.

# termsContact
source: Contact
tr: İletişim

# termsContactDesc
source: For questions about these terms, please contact us.
tr: Kullanım şartları hakkında sorularınız için support@tuncbt.com adresinden bize ulaşabilirsiniz.

source: Send Email
tr: E-posta Gönder

# sendWhatsApp
source: Send WhatsApp Message
tr: WhatsApp'ta Mesaj Gönder

source: Start Chat
tr: Sohbet Başlat

# whatsAppError
source: Could not open WhatsApp
tr: WhatsApp açılamadı

# emailError
source: Could not open email app
tr: E-posta uygulaması açılamadı

# emailSubject
source: TuncBT - Contact
tr: TuncBT - İletişim

# emailBody
source: Hello {name},
tr: Merhaba {name},

# profile_image_size_error
source: Profile image size cannot exceed 5MB
tr: Profil resmi boyutu 5MB'dan büyük olamaz

# invalid_image_format
source: Invalid file format. Only images are allowed
tr: Geçersiz dosya formatı. Sadece resim dosyaları yüklenebilir

# profile_image_upload_failed
source: Failed to upload profile image
tr: Profil resmi yüklenirken bir hata oluştu. Lütfen tekrar deneyin

# sessionExpired
source: Session expired. Please log in again
tr: Oturumunuz sona erdi. Lütfen tekrar giriş yapın

# userNotFoundError
source: User not found. Please log in again
tr: Kullanıcı bilgilerinize ulaşılamadı. Lütfen tekrar giriş yapın

# unexpectedErrorWithAction
source: An unexpected error occurred. Please refresh the page and try again
tr: Beklenmeyen bir hata oluştu. Lütfen sayfayı yenileyip tekrar deneyin

# errorTitleChat
source: Chat Error
tr: Mesaj Hatası

# errorTitleAuth
source: Authentication Error
tr: Giriş Hatası

# errorTitleGroup
source: Group Error
tr: Grup İşlemi Başarısız

# errorTitleUpload
source: Upload Error
tr: Yükleme Hatası

# errorTitleNetwork
source: Network Error
tr: Bağlantı Hatası

source: No permission to send message
tr: Bu mesajı gönderme yetkiniz yok

source: Chat room not found
tr: Sohbet odası bulunamadı

source: Network error
tr: İnternet bağlantınızı kontrol edin

source: Failed to remove member
tr: Üye gruptan çıkarılamadı

source: Failed to promote admin
tr: Yönetici ataması yapılamadı
